/**
 * MOM & BABY ICON - Icon Sức khỏe mẹ và bé
 * Mother holding baby icon
 */

import * as React from "react";

export default function MomBabyIcon({ className = "w-5 h-5" }) {
    return (
        <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
            fill="none"
            className={className}
        >
            <path
                fill="currentColor"
                d="M9 6a3 3 0 1 1 6 0 3 3 0 0 1-6 0zm-4.562 5c.663 0 1.292.255 1.768.71A7.47 7.47 0 0 1 8 16.5h.643c-.116.47-.178.967-.178 1.5 0 .254.014.505.041.75H8c-2.229 0-4.335-.844-5.95-2.346-.427-.396-.675-.95-.675-1.529V13.25c0-.69.56-1.25 1.25-1.25zm15.124 0c.69 0 1.25.56 1.25 1.25v1.625c0 .58-.248 1.133-.675 1.53A8.394 8.394 0 0 1 16 17.75h-.506a5.5 5.5 0 0 0 .041-.75c0-.533-.062-1.03-.178-1.5H16a7.47 7.47 0 0 1 1.794-4.79c.476-.455 1.105-.71 1.768-.71M14.5 13a4.5 4.5 0 1 1 0 9 4.5 4.5 0 0 1 0-9m-.5 2.5v2.086l1.457 1.457a.5.5 0 0 1-.707.707l-1.604-1.603A.75.75 0 0 1 13 17.5v-2a.5.5 0 0 1 1 0"
            ></path>
        </svg>
    );
}
